# Создайте собственный модуль, поместив в него ваши функции, созданные в предыдущих заданиях. Напишите любую программу с использованием функций этого модуля.

import Module as mdl

word = 'Test'
list_words = ['Testosterone', 'Sooo tasty', 'Testable']

print(mdl.findWords(word, list_words))

print(mdl.simpleCalc(5, 18, "*"))